In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

You should end up with something like this:


name \
Billy    0.5250 \
Jane     0.6875 \
John     0.9125 \
Sally    0.7625 \
Name: grade, dtype: float64

In [14]:
df = pd.read_csv('untidy-data/attendance.csv')

In [15]:
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [ ]:
attendance_grades = {'P':1, 'T':.9, 'H':.5, 'A':0}

In [ ]:
df.shape

In [ ]:
df = df.rename(columns={'Unnamed: 0': 'student'})
df = df.melt(id_vars = 'student',
                 var_name = 'date',
                 value_name = 'attendance')
df['grade'] = df.attendance.map(attendance_grades)
df

In [ ]:
df.groupby('student').mean()

In [ ]:
df.pivot_table(values='grade', index='student')

## Coffee Levels

Read the coffee_levels table.

Transform the data so that each carafe is in it's own column.

Is this the best shape for the data?

In [16]:
df = pd.read_csv('untidy-data/coffee_levels.csv')
df

    hour coffee_carafe  coffee_amount
0      8             x       0.816164
1      9             x       0.451018
2     10             x       0.843279
3     11             x       0.335533
4     12             x       0.898291
5     13             x       0.310711
6     14             x       0.507288
7     15             x       0.215043
8     16             x       0.183891
9     17             x       0.391560
10     8             y       0.189297
11     9             y       0.521502
12    10             y       0.023163
13    11             y       0.235529
14    12             y       0.017009
15    13             y       0.997464
16    14             y       0.058361
17    15             y       0.144644
18    16             y       0.544676
19    17             y       0.594126
20     8             z       0.999264
21     9             z       0.915990
22    10             z       0.144928
23    11             z       0.311495
24    12             z       0.771947
25    13             z       0.398520
26    14             z       0.864464
27    15             z       0.436364
28    16             z       0.280621
29    17             z       0.436677

In [17]:
df.pivot_table('coffee_amount','hour','coffee_carafe')

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

Cake Recipes

Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.

Tidy the data as necessary.

Which recipe, on average, is the best? recipe b

Which oven temperature, on average, produces the best results? 275

Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [5]:
df = pd.read_csv('untidy-data/cake_recipes.csv')

In [6]:
df

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084
5           c:top  71.306308  82.795477  92.098049  53.960273
6        d:bottom  52.799753  58.670419  51.747686  56.183110
7           d:top  96.873178  76.101363  59.571620  50.971626

In [8]:
recipe_and_position = df['recipe:position'].str.split(':', expand = True)
recipe_and_position.columns = ['recipe', 'position']
df = (
    pd.concat([df, recipe_and_position], axis = 1)
    .drop(columns= ['recipe:position'])
    .melt(id_vars=['recipe', 'position'], var_name = 'oven_temp', value_name="taste")
)

In [9]:
df.head()

  recipe position oven_temp      taste
0      a   bottom       225  61.738655
1      a      top       225  51.709751
2      b   bottom       225  57.095320
3      b      top       225  82.455004
4      c   bottom       225  96.470207

In [10]:
df.groupby('recipe').taste.mean()

recipe
a    63.922201
b    76.736074
c    75.874748
d    62.864844
Name: taste, dtype: float64

In [12]:
df.groupby('oven_temp').taste.mean()

oven_temp
225    71.306022
250    66.577437
275    74.886754
300    66.627655
Name: taste, dtype: float64

In [13]:
df.sort_values(by='taste').tail(1)

   recipe position oven_temp      taste
26      b   bottom       300  99.248541